Revit 2024 API
ResolutionTarget Enumeration
 Indicates the resolution target(Screen or Printer) used for rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum ResolutionTarget
Visual Basic
Public Enumeration ResolutionTarget
Visual C++
public enum class ResolutionTarget
Members
Member name | Description
Screen |  Uses screen resolution for rendering output settings.
Printer |  Uses printer resolution for rendering output settings.
See Also
Autodesk.Revit.DB Namespace